baseFile/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          19;
        startFace       1574;
    }
    floor
    {
        type            wall;
        inGroups        1(wall);
        nFaces          28;
        startFace       1593;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          786;
        startFace       1621;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          786;
        startFace       2407;
    }
    outlet
    {
        type            patch;
        nFaces          24;
        startFace       3193;
    }
    symm
    {
        type            symmetryPlane;
        nFaces          34;
        startFace       3217;
    }
    slipPatch
    {
        type            patch;
        nFaces          71;
        startFace       3251;
    }
)

// ************************************************************************* //
