baseFile/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    /*#include "include/fixedInlet"

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }

    lowerWall
    {
        type            fixedValue;
        value           $internalField;
    }

    motorBikeGroup
    {
        type            noSlip;
    }

    #include "include/frontBackUpperPatches"*/

    inlet
    {
        type            fixedValue;
        value           $internalField;

    }
    floor
    {
        type            noSlip;

    }
    back
    {
        type            empty;

    }
    front
    {
        type            empty;

    }
    outlet
    {
      type            zeroGradient;
    }
    symm
    {
        type            symmetryPlane;

    }
    slipPatch
    {
        type            slip;
    }

}


// ************************************************************************* //
