baseFile/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    //- Define inlet conditions
    /*#include "include/fixedInlet"

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    lowerWall
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    motorBikeGroup
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    #include "include/frontBackUpperPatches"*/

    inlet
    {
        type            fixedValue;
        value           $internalField;

    }
    floor
    {
        type            kqRWallFunction;
        value           $internalField;

    }
    back
    {
        type            empty;

    }
    front
    {
        type            empty;

    }
    outlet
    {
      type            zeroGradient;
    }
    symm
    {
        type            symmetryPlane;

    }
    slipPatch
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
