baseFile/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    /*frontAndBack
    {
        type            calculated;
        value           uniform 0;
    }

    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    lowerWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    upperWall
    {
        type            calculated;
        value           uniform 0;
    }

    motorBikeGroup
    {
        type            nutkWallFunction;
        value           uniform 0;
    }*/

    inlet
    {
        type            calculated;
        value           $internalField;

    }
    floor
    {
        type            nutkWallFunction;
        value           $internalField;

    }
    back
    {
        type            empty;

    }
    front
    {
        type            empty;

    }
    outlet
    {
      type            calculated;
      value           $internalField;
    }
    symm
    {
        type            symmetryPlane;

    }
    slipPatch
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
