baseFile/system/functions/functionInputs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  | Patrick Bounds Layout                           |
\*---------------------------------------------------------------------------*/

keyPatches floor; //select the patches that you want to apply functions

avgWind 200;

UInf 69.42;
rhoRef 1.32;

writePrec       6;
writeToFile     true;
useUserTime     true;
logged          true;
tStart          0;
tEnd            10000;
executeCon      timeStep;
executeInt      200;
writeCon        timeStep;
writeInt        200;
